; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v1 ?v12)
             (pred_2 ?v10 ?v13)
             (pred_7 ?v1 ?v13)
             (pred_11 ?v9 ?v1 )
	     (pred_9 ?v1)
             (pred_5 ?v8)
             (pred_8 ?v10)
             (pred_3 ?v13)
             (pred_6 ?v1)
             (pred_12 ?v10)
             (pred_1 ?v1)
             (pred_4 ))



(:action op_5
:parameters (?v6 ?v11 ?v7 ?v4)
:precondition (and (pred_5 ?v6) (pred_5 ?v11) (pred_8 ?v7) (pred_3 ?v4)
          (pred_10 ?v6 ?v11) (pred_2 ?v7 ?v4)
                   (pred_7 ?v11 ?v4) (pred_9 ?v6) 
                   (pred_6 ?v11) (pred_12 ?v7))
:effect (and  (pred_1 ?v11) (not (pred_6 ?v11))))


(:action op_2
:parameters (?v6 ?v2)
:precondition (and (pred_5 ?v6) (pred_5 ?v2)
               (pred_9 ?v6) (pred_10 ?v6 ?v2) (pred_1 ?v2))
:effect (and (pred_9 ?v2) (not (pred_9 ?v6))))

(:action op_1
:parameters (?v6 ?v7)
:precondition (and (pred_5 ?v6) (pred_8 ?v7) 
                  (pred_9 ?v6) (pred_11 ?v7 ?v6) (pred_4 ))
:effect (and (pred_12 ?v7)
   (not (pred_11 ?v7 ?v6)) (not (pred_4 ))))


(:action op_4
:parameters (?v6 ?v3 ?v5)
:precondition (and (pred_5 ?v6) (pred_8 ?v3) (pred_8 ?v5)
                  (pred_9 ?v6) (pred_12 ?v5) (pred_11 ?v3 ?v6))
:effect (and (pred_12 ?v3) (pred_11 ?v5 ?v6)
        (not (pred_12 ?v5)) (not (pred_11 ?v3 ?v6))))

(:action op_3
:parameters (?v6 ?v7)
:precondition (and (pred_5 ?v6) (pred_8 ?v7) 
                  (pred_9 ?v6) (pred_12 ?v7))
:effect (and (pred_4 ) (pred_11 ?v7 ?v6) (not (pred_12 ?v7)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_05 obj_07 obj_08 obj_20 obj_28 obj_04 obj_23 obj_26 obj_18 obj_06 obj_01 obj_09 obj_30 obj_29 obj_14 obj_17 obj_27 obj_02 obj_22 obj_25 obj_10 obj_21 obj_16 obj_24 obj_11
    obj_15 obj_12
    obj_03 obj_13 obj_19
    )

    (:init
       (pred_4)

       (pred_5 obj_05)
       (pred_5 obj_07)
       (pred_5 obj_08)
       (pred_5 obj_20)
       (pred_5 obj_28)
       (pred_5 obj_04)
       (pred_5 obj_23)
       (pred_5 obj_26)
       (pred_5 obj_18)
       (pred_5 obj_06)
       (pred_5 obj_01)
       (pred_5 obj_09)
       (pred_5 obj_30)
       (pred_5 obj_29)
       (pred_5 obj_14)
       (pred_5 obj_17)
       (pred_5 obj_27)
       (pred_5 obj_02)
       (pred_5 obj_22)
       (pred_5 obj_25)
       (pred_5 obj_10)
       (pred_5 obj_21)
       (pred_5 obj_16)
       (pred_5 obj_24)
       (pred_5 obj_11)
       (pred_3 obj_15)
       (pred_3 obj_12)
       (pred_8 obj_03)
       (pred_8 obj_13)
       (pred_8 obj_19)

       (pred_10 obj_05 obj_04)
       (pred_10 obj_05 obj_07)
       (pred_10 obj_07 obj_23)
       (pred_10 obj_07 obj_08)
       (pred_10 obj_07 obj_05)
       (pred_10 obj_08 obj_26)
       (pred_10 obj_08 obj_20)
       (pred_10 obj_08 obj_07)
       (pred_10 obj_20 obj_18)
       (pred_10 obj_20 obj_28)
       (pred_10 obj_20 obj_08)
       (pred_10 obj_28 obj_06)
       (pred_10 obj_28 obj_20)
       (pred_10 obj_04 obj_01)
       (pred_10 obj_04 obj_23)
       (pred_10 obj_04 obj_05)
       (pred_10 obj_23 obj_09)
       (pred_10 obj_23 obj_26)
       (pred_10 obj_23 obj_07)
       (pred_10 obj_23 obj_04)
       (pred_10 obj_26 obj_30)
       (pred_10 obj_26 obj_18)
       (pred_10 obj_26 obj_08)
       (pred_10 obj_26 obj_23)
       (pred_10 obj_18 obj_29)
       (pred_10 obj_18 obj_06)
       (pred_10 obj_18 obj_20)
       (pred_10 obj_18 obj_26)
       (pred_10 obj_06 obj_14)
       (pred_10 obj_06 obj_28)
       (pred_10 obj_06 obj_18)
       (pred_10 obj_01 obj_17)
       (pred_10 obj_01 obj_09)
       (pred_10 obj_01 obj_04)
       (pred_10 obj_09 obj_27)
       (pred_10 obj_09 obj_30)
       (pred_10 obj_09 obj_23)
       (pred_10 obj_09 obj_01)
       (pred_10 obj_30 obj_02)
       (pred_10 obj_30 obj_29)
       (pred_10 obj_30 obj_26)
       (pred_10 obj_30 obj_09)
       (pred_10 obj_29 obj_22)
       (pred_10 obj_29 obj_14)
       (pred_10 obj_29 obj_18)
       (pred_10 obj_29 obj_30)
       (pred_10 obj_14 obj_25)
       (pred_10 obj_14 obj_06)
       (pred_10 obj_14 obj_29)
       (pred_10 obj_17 obj_10)
       (pred_10 obj_17 obj_27)
       (pred_10 obj_17 obj_01)
       (pred_10 obj_27 obj_21)
       (pred_10 obj_27 obj_02)
       (pred_10 obj_27 obj_09)
       (pred_10 obj_27 obj_17)
       (pred_10 obj_02 obj_16)
       (pred_10 obj_02 obj_22)
       (pred_10 obj_02 obj_30)
       (pred_10 obj_02 obj_27)
       (pred_10 obj_22 obj_24)
       (pred_10 obj_22 obj_25)
       (pred_10 obj_22 obj_29)
       (pred_10 obj_22 obj_02)
       (pred_10 obj_25 obj_11)
       (pred_10 obj_25 obj_14)
       (pred_10 obj_25 obj_22)
       (pred_10 obj_10 obj_21)
       (pred_10 obj_10 obj_17)
       (pred_10 obj_21 obj_16)
       (pred_10 obj_21 obj_27)
       (pred_10 obj_21 obj_10)
       (pred_10 obj_16 obj_24)
       (pred_10 obj_16 obj_02)
       (pred_10 obj_16 obj_21)
       (pred_10 obj_24 obj_11)
       (pred_10 obj_24 obj_22)
       (pred_10 obj_24 obj_16)
       (pred_10 obj_11 obj_25)
       (pred_10 obj_11 obj_24)
       (pred_6 obj_23)
       (pred_6 obj_25)
       (pred_6 obj_16)
       (pred_7  obj_23 obj_15)
       (pred_7  obj_25 obj_12)
       (pred_7  obj_16 obj_15)
       (pred_1 obj_05)
       (pred_1 obj_07)
       (pred_1 obj_08)
       (pred_1 obj_20)
       (pred_1 obj_28)
       (pred_1 obj_04)
       (pred_1 obj_26)
       (pred_1 obj_18)
       (pred_1 obj_06)
       (pred_1 obj_01)
       (pred_1 obj_09)
       (pred_1 obj_30)
       (pred_1 obj_29)
       (pred_1 obj_14)
       (pred_1 obj_17)
       (pred_1 obj_27)
       (pred_1 obj_02)
       (pred_1 obj_22)
       (pred_1 obj_10)
       (pred_1 obj_21)
       (pred_1 obj_24)
       (pred_1 obj_11)

       (pred_2  obj_03 obj_15)
       (pred_2  obj_13 obj_12)
       (pred_2  obj_19 obj_15)
       (pred_11 obj_03 obj_14)
       (pred_11 obj_13 obj_20)
       (pred_11 obj_19 obj_27)
       (pred_9 obj_07)
    )

    (:goal (and
       (pred_11 obj_03 obj_18)
       (pred_11 obj_13 obj_17)
       (pred_11 obj_19 obj_06)
    ))
(:constraints
  (always (not (pred_9 obj_29)))
)
)

; plan
1. (op_2 obj_07 obj_05)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_05)
   goals met: 0 of 3
2. (op_2 obj_05 obj_04)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_04)
   goals met: 0 of 3
3. (op_2 obj_04 obj_01)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_01)
   goals met: 0 of 3
4. (op_2 obj_01 obj_17)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_17)
   goals met: 0 of 3
5. (op_2 obj_17 obj_27)
   deleted: (pred_9 obj_17)
   added: (pred_9 obj_27)
   goals met: 0 of 3
6. (op_1 obj_27 obj_19)
   deleted: (pred_11 obj_19 obj_27) (pred_4)
   added: (pred_12 obj_19)
   goals met: 0 of 3
7. (op_2 obj_27 obj_09)
   deleted: (pred_9 obj_27)
   added: (pred_9 obj_09)
   goals met: 0 of 3
8. (op_2 obj_09 obj_30)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_30)
   goals met: 0 of 3
9. (op_2 obj_30 obj_26)
   deleted: (pred_9 obj_30)
   added: (pred_9 obj_26)
   goals met: 0 of 3
10. (op_2 obj_26 obj_18)
   deleted: (pred_9 obj_26)
   added: (pred_9 obj_18)
   goals met: 0 of 3
11. (op_2 obj_18 obj_06)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_06)
   goals met: 0 of 3
12. (op_3 obj_06 obj_19)
   deleted: (pred_12 obj_19)
   added: (pred_4) (pred_11 obj_19 obj_06)
   goals met: 1 of 3
13. (op_2 obj_06 obj_14)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_14)
   goals met: 1 of 3
14. (op_1 obj_14 obj_03)
   deleted: (pred_11 obj_03 obj_14) (pred_4)
   added: (pred_12 obj_03)
   goals met: 1 of 3
15. (op_2 obj_14 obj_06)
   deleted: (pred_9 obj_14)
   added: (pred_9 obj_06)
   goals met: 1 of 3
16. (op_2 obj_06 obj_18)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_18)
   goals met: 1 of 3
17. (op_3 obj_18 obj_03)
   deleted: (pred_12 obj_03)
   added: (pred_4) (pred_11 obj_03 obj_18)
   goals met: 2 of 3
18. (op_2 obj_18 obj_20)
   deleted: (pred_9 obj_18)
   added: (pred_9 obj_20)
   goals met: 2 of 3
19. (op_1 obj_20 obj_13)
   deleted: (pred_11 obj_13 obj_20) (pred_4)
   added: (pred_12 obj_13)
   goals met: 2 of 3
20. (op_2 obj_20 obj_08)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_08)
   goals met: 2 of 3
21. (op_2 obj_08 obj_07)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_07)
   goals met: 2 of 3
22. (op_2 obj_07 obj_05)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_05)
   goals met: 2 of 3
23. (op_2 obj_05 obj_04)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_04)
   goals met: 2 of 3
24. (op_2 obj_04 obj_01)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_01)
   goals met: 2 of 3
25. (op_2 obj_01 obj_17)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_17)
   goals met: 2 of 3
26. (op_3 obj_17 obj_13)
   deleted: (pred_12 obj_13)
   added: (pred_4) (pred_11 obj_13 obj_17)
   goals met: 3 of 3
